{
  "backend/main.mo": "Actor defining game types, user profiles, rooms, match state, scoring, and maintaining all backend state maps and constants.",
  "feature_evidence.json": "Feature evidence report documenting a STOP-sign image update change and associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of multiple frontend source files and their recent feature updates.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light/dark theme variables and base styles.",
  "frontend/index.html": "Main HTML entry point with PWA metadata, icons, fonts, and service worker registration.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying metadata, icons, theme colors, and categories for the app.",
  "frontend/public/sw.js": "Minimal service worker implementing install, activation, and network‑first fetch handling.",
  "frontend/src/App.tsx": "React application route configuration using TanStack Router with screens for game flows, leaderboard, store, and admin.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and error handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users without profiles to register a display name via backend mutation.",
  "frontend/src/components/game/LetterRoulette.tsx": "Animated letter roulette component that cycles through the Spanish alphabet and highlights used or selected letters.",
  "frontend/src/components/game/ScoreboardTable.tsx": "Displays a sortable scoreboard table with rankings, handling loading states and highlighting the current user.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with footer, PWA install flow, and a dialog for manual installation instructions.",
  "frontend/src/content/copy.ts": "Centralized Spanish UI copy strings for menus, gameplay, dialogs, and store content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useAdmin.ts": "Admin-related hooks for checking admin status and performing admin mutations like banning users or words.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user's profile using the actor and exposes authentication state and derived user info.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identities, and AuthClient lifecycle.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Handles PWA install prompt events and exposes canInstall plus a promptInstall function.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for room, matchmaking, round, and user-related backend actions with cache invalidation.",
  "frontend/src/hooks/useStripeCheckout.ts": "Defines mutations to create Stripe checkout sessions and query session status, with basic config placeholder.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentity provider.",
  "frontend/src/screens/admin/AdminScreen.tsx": "Admin panel with metrics, dictionary management, and user tools, including adding or banning words.",
  "frontend/src/screens/GameScreen.tsx": "Renders the active game UI, manages rounds, letter roulette, word submission, and navigation.",
  "frontend/src/screens/LobbyScreen.tsx": "Displays room lobby, allowing players to join, leave, start the game, and share invite links.",
  "frontend/src/screens/MainMenuScreen.tsx": "Main menu with login, room creation/joining, matchmaking, PWA install prompt, and navigation options.",
  "frontend/src/screens/MonthlyLeaderboardScreen.tsx": "Displays the monthly leaderboard, handles loading/error states, highlights top players, and allows navigation back to the menu.",
  "frontend/src/screens/RankingScreen.tsx": "Shows match rankings based on backend cumulative scores, highlights top user, and provides navigation to leaderboard or menu.",
  "frontend/src/screens/SplashScreen.tsx": "Renders the splash screen with logo, title, and a button that navigates to the main menu.",
  "frontend/src/screens/store/PaymentFailureScreen.tsx": "Shows a payment failure message with options to retry or return to the menu.",
  "frontend/src/screens/store/PaymentSuccessScreen.tsx": "Shows a payment success message, refreshes user data, and provides a button back to the menu.",
  "frontend/src/screens/store/StoreScreen.tsx": "Lists purchasable products and triggers Stripe checkout sessions for selected items.",
  "frontend/src/screens/TribunalScreen.tsx": "Displays automatic validation results for submitted words and provides navigation to the ranking screen.",
  "frontend/src/utils/backendScoring.ts": "Provides helpers to normalize backend score arrays, retrieve a player’s score, and sort players by descending points.",
  "frontend/src/utils/scorePersistence.ts": "Deprecated session‑storage utilities to save, read, and clear per‑room round scores as a non‑authoritative fallback.",
  "frontend/src/utils/scoring.ts": "Implements per‑round scoring logic based on word validation and calculates cumulative totals across rounds.",
  "frontend/src/utils/share.ts": "Offers Web Share integration, social-share URL builders, clipboard copying, and invite message helpers.",
  "frontend/src/utils/spanishAlphabet.ts": "Exports the canonical Spanish alphabet including Ñ and its associated type.",
  "frontend/src/utils/stopVoice.ts": "Plays a 'STOP!' voice line using the Web Speech API with basic error handling.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL or session parameters, supporting hash and query routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and plugin setup for the frontend build.",
  "project_state.json": "Project metadata detailing scope, architecture, known issues, required assets, and implemented features."
}